In [1]:
import pandas as pd
df = pd.read_csv("wheather_df.csv")
df

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2017           35          7  Sunny
2   1/3/20217           28          2   Snow
3  01-04-2017           24          7   Snow
4  01-05-2017           32          4   Rain
5  01-06-2017           32          2  Sunny

In [2]:
df.shape

(6, 4)

In [3]:
df.head() #print few rows from start of dataframe

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2017           35          7  Sunny
2   1/3/20217           28          2   Snow
3  01-04-2017           24          7   Snow
4  01-05-2017           32          4   Rain

In [4]:
df.tail() #print few rows from last of dataframe

          day  temperature  windspeed  event
1  01-02-2017           35          7  Sunny
2   1/3/20217           28          2   Snow
3  01-04-2017           24          7   Snow
4  01-05-2017           32          4   Rain
5  01-06-2017           32          2  Sunny

In [5]:
#custom range of data frame
df[2:5]

          day  temperature  windspeed event
2   1/3/20217           28          2  Snow
3  01-04-2017           24          7  Snow
4  01-05-2017           32          4  Rain

In [6]:
df.columns # shows all columns of the dataframe

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [7]:
df.day #shows particular columns by using there name

0    01-01-2017
1    01-02-2017
2     1/3/20217
3    01-04-2017
4    01-05-2017
5    01-06-2017
Name: day, dtype: object

In [8]:
df.event

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [9]:
type(df['event'])

pandas.core.series.Series

In [10]:
df[['event','day', 'temperature']]

   event         day  temperature
0   Rain  01-01-2017           32
1  Sunny  01-02-2017           35
2   Snow   1/3/20217           28
3   Snow  01-04-2017           24
4   Rain  01-05-2017           32
5  Sunny  01-06-2017           32

## Operation on DataFrame

In [11]:
#finding maximum

df['temperature'].max()

35

In [12]:
#finding minimum
df['temperature'].min()

24

In [13]:
#finding mean 
df['temperature'].mean()

30.5

In [14]:
#this function help in all the operation on integers type data

df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.500000   4.666667
std       3.885872   2.338090
min      24.000000   2.000000
25%      29.000000   2.500000
50%      32.000000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [15]:
#user defined query

df[df.temperature >= 32]

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2017           35          7  Sunny
4  01-05-2017           32          4   Rain
5  01-06-2017           32          2  Sunny

In [16]:
df[df.temperature == df['temperature'].max()]

          day  temperature  windspeed  event
1  01-02-2017           35          7  Sunny

In [17]:
#if you want only day

df['day'][df.temperature == df['temperature'].max()]

1    01-02-2017
Name: day, dtype: object

In [18]:
df

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2017           35          7  Sunny
2   1/3/20217           28          2   Snow
3  01-04-2017           24          7   Snow
4  01-05-2017           32          4   Rain
5  01-06-2017           32          2  Sunny

In [19]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [20]:
df.set_index('day', inplace=True)

In [21]:
 df

            temperature  windspeed  event
day
01-01-2017           32          6   Rain
01-02-2017           35          7  Sunny
1/3/20217            28          2   Snow
01-04-2017           24          7   Snow
01-05-2017           32          4   Rain
01-06-2017           32          2  Sunny

In [22]:
df.reset_index(inplace=True)

In [23]:
df

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2017           35          7  Sunny
2   1/3/20217           28          2   Snow
3  01-04-2017           24          7   Snow
4  01-05-2017           32          4   Rain
5  01-06-2017           32          2  Sunny